Documents/ПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ПоступлениеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.Бронирование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиВзаиморасчетов</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыОплатыБронирований</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыДоходыИРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МояОрганизация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГостьИлиОрганизатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГостиИОрганизаторы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВВалютеДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйНеотрицательныйТип</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйНеотрицательныйТип</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиВзаиморасчетов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МояОрганизация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронирующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГостиИОрганизаторы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОборотыДоходыИРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыДоходыИРасходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МояОрганизация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СредствоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяАналитики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатьиРасходов</v8:Type>
						<v8:Type>cfg:EnumRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОборотыОплатыБронирований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыОплатыБронирований</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатьиДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СтатьиДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГостиничныеУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеДенежныхСредств/Ext/ObjectModule.bsl
///Copyright (c) 2021, https://github.com/Larii75.
///
///Разрешается повторное распространение и использование как в виде исходного кода, так и в двоичной форме, с изменениями или без, при соблюдении следующих условий:
///
///При повторном распространении исходного кода должно оставаться указанное выше уведомление об авторском праве, этот список условий и последующий отказ от гарантий.
///При повторном распространении двоичного кода должна сохраняться указанная выше информация об авторском праве, этот список условий и последующий отказ от гарантий 
///в документации и/или в других материалах, поставляемых при распространении. 
///Ни название <Организации>, ни имена её сотрудников не могут быть использованы в качестве поддержки или продвижения продуктов, основанных на этом ПО без предварительного письменного разрешения.
///ЭТА ПРОГРАММА ПРЕДОСТАВЛЕНА ВЛАДЕЛЬЦАМИ АВТОРСКИХ ПРАВ И/ИЛИ ДРУГИМИ СТОРОНАМИ «КАК ОНА ЕСТЬ» БЕЗ КАКОГО-ЛИБО ВИДА ГАРАНТИЙ, ВЫРАЖЕННЫХ ЯВНО ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ, 
///ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ. 
///НИ В КОЕМ СЛУЧАЕ НИ ОДИН ВЛАДЕЛЕЦ АВТОРСКИХ ПРАВ И НИ ОДНО ДРУГОЕ ЛИЦО, КОТОРОЕ МОЖЕТ ИЗМЕНЯТЬ И/ИЛИ ПОВТОРНО РАСПРОСТРАНЯТЬ ПРОГРАММУ, КАК БЫЛО СКАЗАНО ВЫШЕ, НЕ НЕСЁТ ОТВЕТСТВЕННОСТИ,
///ВКЛЮЧАЯ ЛЮБЫЕ ОБЩИЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ ИЛИ ПОСЛЕДОВАВШИЕ УБЫТКИ, ВСЛЕДСТВИЕ ИСПОЛЬЗОВАНИЯ ИЛИ НЕВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ ПРОГРАММЫ 
///(ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ПОТЕРЕЙ ДАННЫХ, ИЛИ ДАННЫМИ, СТАВШИМИ НЕПРАВИЛЬНЫМИ, ИЛИ ПОТЕРЯМИ, ПРИНЕСЕННЫМИ ИЗ-ЗА ВАС ИЛИ ТРЕТЬИХ ЛИЦ, 
///ИЛИ ОТКАЗОМ ПРОГРАММЫ РАБОТАТЬ СОВМЕСТНО С ДРУГИМИ ПРОГРАММАМИ), ДАЖЕ ЕСЛИ ТАКОЙ ВЛАДЕЛЕЦ ИЛИ ДРУГОЕ ЛИЦО БЫЛИ ИЗВЕЩЕНЫ О ВОЗМОЖНОСТИ ТАКИХ УБЫТКОВ.
///
///Copyright (c) 2021, https://github.com/Larii75 All rights reserved.
///
///Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:
///
///Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.
///Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.
///Neither the name of the <ORGANIZATION> nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.
///THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, 
///THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER 
///OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, 
///PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
///LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
///EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

#Если Сервер ИЛИ ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Бронирование") Тогда
		ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		ВалютаУчета = ДанныеЗаполнения.ВалютаУчета;
		МояОрганизация = ДанныеЗаполнения.МояОрганизация;
		Бронирование = ДанныеЗаполнения.Ссылка;
		ГостьИлиОрганизатор = ДанныеЗаполнения.Бронируюущий;
		СуммаВВалютеДокумента = ДанныеЗаполнения.СуммаВВалютеДокумента;
		СуммаВВалютеУчета = ДанныеЗаполнения.СуммаВВалютеУчета;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоНовый() Тогда
		//TODO
		Если ВалютаДокумента = ВалютаУчета Тогда
			СуммаВВалютеУчета = СуммаВВалютеДокумента;
		Иначе
			Отказ = Истина;
			ВызватьИсключение("Функция в разработке!")
		КонецЕсли;

		СлужебнаяСсылка = Документы.ПоступлениеДенежныхСредств.ПолучитьСсылку(Новый УникальныйИдентификатор());
		УстановитьСсылкуНового(СлужебнаяСсылка);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиВзаиморасчетов.Записывать = Истина;
	Движения.ОстаткиВзаиморасчетов.Очистить();
 	Движения.ОстаткиВзаиморасчетов.Записать();
	
	Движения.ОборотыДоходыИРасходы.Записывать = Истина;
	Движения.ОборотыДоходыИРасходы.Очистить();
 	Движения.ОборотыДоходыИРасходы.Записать();
	
	Движения.ОборотыОплатыБронирований.Записывать = Истина;
	Движения.ОборотыОплатыБронирований.Очистить();
 	Движения.ОборотыОплатыБронирований.Записать();
	
	Движения.ОстаткиВзаиморасчетов.БлокироватьДляИзменения = Истина;
	Движения.ОборотыДоходыИРасходы.БлокироватьДляИзменения = Истина;
	Движения.ОборотыОплатыБронирований.БлокироватьДляИзменения = Истина;
	
	Движения.ОстаткиВзаиморасчетов.Записывать = Истина;
	Движения.ОборотыДоходыИРасходы.Записывать = Истина;
	Движения.ОборотыОплатыБронирований.Записывать = Истина;

	// регистр ОстаткиВзаиморасчетов Расход
	Движение = Движения.ОстаткиВзаиморасчетов.ДобавитьРасход();
	Движение.Бронирование = Бронирование;
	Движение.Период = Дата;
	Движение.МояОрганизация = МояОрганизация;
	Движение.Бронирующий = Бронирование.Бронирующий;
	Движение.ВалютаУчета = ВалютаУчета;
	Движение.СуммаВВалютеУчета = СуммаВВалютеУчета;
	
	// регистр ОборотыДоходыИРасходы
	Движение2 = Движения.ОборотыДоходыИРасходы.Добавить();
	Движение2.Период = Дата;
	Движение2.МояОрганизация = МояОрганизация;
	Движение2.СредствоРазмещения = Бронирование.СредствоРазмещения;
	Движение2.СтатьяАналитики = ПредопределенноеЗначение("Перечисление.СтатьиДоходов.ГостиничныеУслуги");
	Движение2.Бронирование = Бронирование;
	Движение2.ВалютаУчета = ВалютаУчета;
	Движение2.СуммаВВалютеУчета = СуммаВВалютеУчета;
	
	// регистр ОборотыОплатыБронирований
	Движение3 = Движения.ОборотыОплатыБронирований.Добавить();
	Движение3.Период = Дата;
	Движение3.Бронирование = Бронирование;
	Движение3.ВалютаУчета = ВалютаУчета;
	Движение3.СуммаВВалютеУчета = СуммаВВалютеУчета;

		
КонецПроцедуры

#Иначе

ВызватьИсключение("Недопустимый вызов объекта на клиенте!");

#КонецЕсли
